{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "BertProcessing",
    "sep": [
      "[SEP]",
      3
    ],
    "cls": [
      "[CLS]",
      2
    ]
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "voltage": 5,
      "current": 6,
      "temperature": 7,
      "soc": 8,
      "soh": 9,
      "capacity": 10,
      "resistance": 11,
      "charging": 12,
      "discharging": 13,
      "thermal": 14,
      "degradation": 15,
      "cycle": 16,
      "health": 17,
      "battery": 18,
      "cell": 19,
      "pack": 20,
      "module": 21,
      "system": 22,
      "management": 23,
      "optimization": 24,
      "prediction": 25,
      "forecast": 26,
      "anomaly": 27,
      "safety": 28,
      "efficiency": 29,
      "performance": 30,
      "lifespan": 31,
      "longevity": 32,
      "maintenance": 33,
      "replacement": 34,
      "monitoring": 35,
      "sensor": 36,
      "telemetry": 37,
      "data": 38,
      "signal": 39,
      "measurement": 40,
      "value": 41,
      "reading": 42,
      "timestamp": 43,
      "sequence": 44,
      "pattern": 45,
      "trend": 46,
      "behavior": 47,
      "state": 48,
      "condition": 49,
      "status": 50,
      "alert": 51,
      "warning": 52,
      "error": 53,
      "fault": 54,
      "failure": 55,
      "normal": 56,
      "abnormal": 57,
      "critical": 58,
      "safe": 59,
      "unsafe": 60,
      "high": 61,
      "low": 62,
      "medium": 63,
      "stable": 64,
      "unstable": 65,
      "increasing": 66,
      "decreasing": 67,
      "constant": 68,
      "variable": 69,
      "fluctuating": 70,
      "min": 71,
      "max": 72,
      "avg": 73,
      "mean": 74,
      "median": 75,
      "std": 76,
      "variance": 77,
      "range": 78,
      "threshold": 79,
      "limit": 80,
      "boundary": 81,
      "constraint": 82,
      "parameter": 83,
      "feature": 84,
      "attribute": 85,
      "characteristic": 86,
      "property": 87,
      "metric": 88,
      "indicator": 89,
      "index": 90,
      "score": 91,
      "rating": 92,
      "grade": 93,
      "level": 94,
      "degree": 95,
      "magnitude": 96,
      "intensity": 97,
      "severity": 98,
      "priority": 99,
      "importance": 100
    }
  },
  "special_tokens": {
    "pad_token": "[PAD]",
    "unk_token": "[UNK]",
    "cls_token": "[CLS]",
    "sep_token": "[SEP]",
    "mask_token": "[MASK]"
  },
  "battery_specific_tokens": {
    "description": "Battery domain-specific tokens for improved understanding",
    "electrical_terms": ["voltage", "current", "resistance", "capacity", "soc", "soh"],
    "thermal_terms": ["temperature", "thermal", "cooling", "heating"],
    "operational_terms": ["charging", "discharging", "cycling", "idle"],
    "health_terms": ["degradation", "aging", "health", "lifespan", "longevity"],
    "safety_terms": ["safe", "unsafe", "critical", "warning", "alert", "fault"],
    "measurement_terms": ["sensor", "telemetry", "measurement", "reading", "value"]
  },
  "tokenization_config": {
    "max_sequence_length": 512,
    "padding_strategy": "max_length",
    "truncation_strategy": "longest_first",
    "return_attention_mask": true,
    "return_token_type_ids": true,
    "add_special_tokens": true
  }
}
